from collections import ChainMap
from typing import Mapping


LEXICON_COMMANDS: dict[str, str] = {
    '/start': '<b>Привет!</b>\nДавай с тобой сыграем в игру '
              '"Камень, ножницы, бумага"?\n\nЕсли ты, вдруг, '
              'забыл правила, команда /help тебе поможет!\n\n<b>Играем?</b>',
    '/help': 'Это очень простая игра. Мы одновременно должны '
             'сделать выбор одного из трех предметов. Камень, '
             'ножницы или бумага.\n\nЕсли наш выбор '
             'совпадает - ничья, а в остальных случаях камень '
             'побеждает ножницы, ножницы побеждают бумагу, '
             'а бумага побеждает камень.\n\n<b>Играем?</b>',
}

LEXICON_MOVES: dict[str, str] = {
    'rock': '🪨 Камень',
    'paper': '📜 Бумага',
    'scissors': '✂ Ножницы',
}

LEXICON_BUTTONS: dict[str, str] = {
    'yes_button': 'Давай!',
    'no_button': 'Не хочу!',
}

LEXICON_ANSWERS: dict[str, str] = {
    'other_answer': 'Извини, увы, это сообщение мне непонятно...',
    'yes': 'Отлично! Делай свой выбор!',
    'no': 'Жаль...\nЕсли захочешь сыграть, просто разверни '
          'клавиатуру и нажми кнопку "Давай!"',
    'bot_won': 'Я победил!\n\nСыграем еще?',
    'user_won': 'Ты победил! Поздравляю!\n\nДавай сыграем еще?',
    'nobody_won': 'Ничья!\n\nПродолжим?',
    'bot_choice': 'Мой выбор',
    'user_choice': 'Твой выбор',
}

LEXICON_WARNINGS: dict[str, str] = {
    'invalid_move_choise': 'Такой выбор невозможен, '
                           'выбери что-то из предложенного!',
}

LEXICON: Mapping[str, str] = ChainMap(
    LEXICON_COMMANDS,
    LEXICON_MOVES,
    LEXICON_BUTTONS,
    LEXICON_ANSWERS,
    LEXICON_WARNINGS
)
